/********************************************************************************
**
**  文件名称:  yx_list.c
**  版权所有:  CopyRight @ Xiamen Yaxon NetWork CO.LTD. 2019
**  文件描述:  链表工具模块
**
*********************************************************************************
**             修改历史记录
**===============================================================================
**| 日期       | 作者   | 修改记录
**===============================================================================
**| 2019-12-11 | 夏普   | 创建本模块
*********************************************************************************/


/*************************************************************************
头文件引用声明
*************************************************************************/
#include "yx_list.h"


/*************************************************************************
内部宏定义
*************************************************************************/





/*************************************************************************
静态函数声明

extern 外部函数声明
*************************************************************************/



/*************************************************************************
函数定义
*************************************************************************/

/*******************************************************************
** 函数名:     _yx_list_add
** 功能描述:   插入一个节点
** 参数:       [in]  ptNew:         新的节点
**             [in]  ptPrev:        前一个节点
**             [in]  ptNext:        后一个节点
** 返回:       无
********************************************************************/
static void _yx_list_add(yx_list_t * ptNew, yx_list_t * ptPrev, yx_list_t * ptNext)
{
    ptNext->prev = ptNew;
    ptNew->next = ptNext;
    ptNew->prev = ptPrev;
    ptPrev->next = ptNew;
}


/*******************************************************************
** 函数名:     _yx_list_del
** 功能描述:   将前后的节点链接，从而从链表上删除本节点
** 参数:       [in]  ptPrev:        前一个节点
**             [in]  ptNext:        后一个节点
** 返回:       无
********************************************************************/
static void _yx_list_del(yx_list_t *ptPrev, yx_list_t *ptNext)
{
    ptNext->prev = ptPrev;
    ptPrev->next = ptNext;
}


/*******************************************************************
** 函数名:     yx_list_init
** 功能描述:   链表初始化
** 参数:       [in]  ptList:        链表
** 返回:       操作结果
********************************************************************/
int yx_list_init(yx_list_t *ptList)
{
    if (NULL == ptList) {
        return FAIL;
    }
    ptList->next = ptList;
    ptList->prev = ptList;
    return SUCC;
}

/*******************************************************************
** 函数名:     yx_list_add_after
** 功能描述:   在链表的最后增加一个节点
** 参数:       [in]  ptList:        链表
**             [in]  ptNew:         新的节点
** 返回:       无
********************************************************************/
int yx_list_add_after(yx_list_t *ptList, yx_list_t *ptNew)
{
    if ((NULL == ptList) || (NULL == ptNew)) {
        return FAIL;
    }
    _yx_list_add(ptNew, ptList, ptList->next);
    return SUCC;
}

/*******************************************************************
** 函数名:     yx_list_add_before
** 功能描述:   在链表的最前面添加一个节点
** 参数:       [in]  ptList:        链表
**             [in]  ptNew:         新的节点
** 返回:       无
********************************************************************/
int yx_list_add_before(yx_list_t *ptList, yx_list_t *ptNew)
{
    if ((NULL == ptList) || (NULL == ptNew))
        return FAIL;
    
    _yx_list_add(ptNew, ptList->prev, ptList);
    return SUCC;
}

/*******************************************************************
** 函数名:     yx_list_del
** 功能描述:   将一个节点从它所在的链表上删除
** 参数:       [in]  ptEntry:       要删除的节点
** 返回:       无
********************************************************************/
int yx_list_del(yx_list_t *ptEntry)
{
    if (NULL == ptEntry) {
        return FAIL;
    }
    
    if ((NULL != ptEntry->next) && (NULL != ptEntry->prev)) {
        _yx_list_del(ptEntry->prev, ptEntry->next);
        ptEntry->next = NULL;
        ptEntry->prev = NULL;
    }   
    return SUCC;
}


/*******************************************************************
** 函数名:     yx_list_empty
** 功能描述:   检测链表节点是否为空
** 参数:       [in]  ptListHead:    链表
** 返回:       TRUE or FALSE
********************************************************************/
BOOLEAN yx_list_empty(yx_list_t *ptListHead)
{
    if (NULL == ptListHead) {
        return FALSE;
    }
    
    return (BOOLEAN)(ptListHead->next == ptListHead);
}



/*******************************************************************
** 函数名:     yx_list_get_count
** 功能描述:   获取链表节点数量
** 参数:       [in]  ptListHead:    链表
** 返回:       节点数量
********************************************************************/
int yx_list_get_count(yx_list_t *ptListHead)
{
    int usCount = 0;
    yx_list_t * pPos = NULL;

    if (NULL == ptListHead) {
        return 0;
    }
    
    YX_LIST_FOR_EACH(ptListHead, pPos) {
        usCount++;
    }
    return usCount;
}





